import React from "react";
import Card from "./Card";
import "./App.css";
import Box from '@mui/material/Box';
import Button from '@mui/material/Button';
import Stack from '@mui/material/Stack';
import Container from '@mui/material/Container';
import Typography from "@mui/material/Typography";

function App() {
  let levelOne = [
    "ΠΟΙΑ ΗΤΑΝ Η ΠΡΩΤΗ ΣΟΥ ΕΝΤΥΠΩΣΗ ΓΙΑ ΜΕΝΑ;",
    "ΠΟΙΟ ΠΙΣΤΕΥΕΙΣ ΟΤΙ ΕΙΝΑΙ ΤΟ ΠΙΟ ΔΥΣΚΟΛΟ ΜΕΡΟΣ ΤΗΣ ΔΟΥΛΕΙΑΣ ΜΟΥ",
    "ΠΟΙΟ REALITY ΠΙΣΤΕΥΕΙΣ ΟΤΙ ΕΙΝΑΙ ΠΙΟ ΠΙΘΑΝΟ ΝΑ ΠΑΡΑΚΟΛΟΥΘΗΣΩ ΣΕ ΤΗΛΕΟΠΤΙΚΟ ΜΑΡΑΘΩΝΙΟ; ΕΞΗΓΗΣΕ.",
    "ΦΑΙΝΟΜΑΙ ΝΑ ΠΡΟΤΙΜΩ ΤΙΣ ΓΑΤΕΣ Η ΤΟΥΣ ΣΚΥΛΟΥΣ;",
    "ΤΙ ΣΟΥ ΛΕΝΕ ΤΑ ΠΑΠΟΥΤΣΙΑ ΜΟΥ ΓΙΑ ΜΕΝΑ;",
    "ΦΑΙΝΟΜΑΙ ΠΕΡΙΣΣΟΤΕΡΟ ΔΗΜΙΟΥΡΓΙΚΟΣ Η ΑΝΑΛΥΤΙΚΟΣ ΤΥΠΟΣ ΑΝΘΡΩΠΟΥ; ΕΞΗΓΗΣΕ.",
    "ΠΟΣΕΣ ΚΛΗΣΕΙΣ ΓΙΑ ΥΠΕΡΒΟΛΙΚΗ ΤΑΧΥΤΗΤΑ ΝΟΜΙΖΕΙΣ ΟΤΙ ΕΧΩ ΠΑΡΕΙ ΣΤΗ ΖΩΗ ΜΟΥ;",
    "ΜΟΙΑΖΩ ΜΕ ΚΑΠΟΙΟΝ ΠΟΥ ΘΑ ΕΚΑΝΕ ΤΑΤΟΥΑΖ ΕΝΑ ΟΝΟΜΑ ΠΑΝΩ ΤΟΥ;",
    "ΣΕ ΤΙ ΝΟΜΙΖΕΙΣ ΟΤΙ ΕΙΝΑΙ ΠΙΟ ΠΙΘΑΝΟ ΝΑ ΣΠΑΤΑΛΗΣΩ ΧΡΗΜΑΤΑ;",
    "ΟΛΟΚΛΗΡΩΣΕ ΤΗΝ ΠΡΟΤΑΣΗ: ΑΠΛΑ ΚΟΙΤΑΖΟΝΤΑΣ ΣΕ ΘΑ ΣΚΕΦΤΟΜΟΥΝ ____.",
    "ΠΟΙΟΝ ΧΑΡΑΚΤΗΡΑ ΘΑ ΕΠΑΙΖΑ ΣΕ ΜΙΑ ΤΑΙΝΙΑ;",
    "ΣΟΥ ΘΥΜΙΖΩ ΚΑΠΟΙΟΝ;",
    "ΠΟΙΑ ΝΟΜΙΖΕΙΣ ΟΤΙ ΕΙΝΑΙ Η ΚΑΨΟΥΡΑ ΜΟΥ ΜΕ ΔΙΑΣΗΜΟ;",
    "ΝΟΜΙΖΕΙΣ ΟΤΙ ΕΧΩ ΚΟΙΤΑΞΕΙ ΠΟΤΕ ΣΤΟ ΤΗΛΕΦΩΝΟ ΕΝΟΣ ΠΡΩΗΝ ΓΙΑ ΑΠΟΔΕΙΞΕΙΣ;",
    "ΠΟΙΟ ΕΙΝΑΙ ΤΟ ΠΡΩΤΟ ΠΡΑΓΜΑ ΠΟΥ ΠΑΡΑΤΗΡΗΣΕΣ ΠΑΝΩ ΜΟΥ;",
    "ΦΑΙΝΟΜΑΙ ΝΑ ΕΙΜΑΙ ΑΝΘΡΩΠΟΣ ΤΟΥ ΚΑΦΕ Η ΤΟΥ ΤΣΑΓΙΟΥ; ΤΟΥ ΓΛΥΚΟΥ Η ΤΟΥ ΠΙΚΡΟΥ;",
    "ΠΟΙΟ ΝΟΜΙΖΕΙΣ ΟΤΙ ΕΙΝΑΙ ΤΟ ΑΓΑΠΗΜΕΝΟ ΜΟΥ ΤΡΑΓΟΥΔΙ ΓΙΑ ΚΑΡΑΟΚΕ;",
    "ΑΝ ΜΟΥ ΑΓΟΡΑΖΕΣ ΕΝΑ ΔΩΡΟ, ΧΩΡΙΣ ΝΑ ΞΕΡΕΙΣ ΤΙΠΟΤΑ ΓΙΑ ΜΕΝΑ ΕΚΤΟΣ ΑΠΟ ΤΟ ΠΩΣ ΜΟΙΑΖΩ, ΠΟΙΟ ΘΑ ΗΤΑΝ ΑΥΤΟ;",
    "ΤΙ ΣΟΥ ΛΕΕΙ Η ΤΑΠΕΤΣΑΡΙΑ ΤΟΥ ΚΙΝΗΤΟΥ ΜΟΥ ΓΙΑ ΜΕΝΑ;",
    "ΦΑΙΝΟΜΑΙ ΕΥΓΕΝΙΚΟΣ; ΕΞΗΓΗΣΕ.",
    "ΠΙΣΤΕΥΕΙΣ ΟΤΙ ΕΡΩΤΕΥΟΜΑΙ ΕΥΚΟΛΑ; ΓΙΑΤΙ Η ΓΙΑΤΙ ΟΧΙ;",
    "ΩΣ ΠΑΙΔΙ, ΤΙ ΝΟΜΙΖΕΙΣ ΟΤΙ ΗΘΕΛΑ ΝΑ ΓΙΝΩ;",
    "ΠΙΣΤΕΥΕΙΣ ΟΤΙ ΣΥΝΗΘΩΣ ΠΗΓΑΙΝΩ ΝΩΡΙΣ, ΣΤΗΝ ΩΡΑ ΜΟΥ Η ΑΡΓΩ ΣΤΙΣ ΕΚΔΗΛΩΣΕΙΣ; ΕΞΗΓΗΣΕ.",
    "ΣΕ ΠΟΙΟ ΜΑΘΗΜΑ ΝΟΜΙΖΕΙΣ ΟΤΙ ΤΑ ΠΗΓΑΙΝΑ ΠΟΛΥ ΚΑΛΑ ΣΤΟ ΣΧΟΛΕΙΟ; ΜΗΠΩΣ ΑΠΕΤΥΧΑ ΣΕ ΚΑΠΟΙΟ;",
    "ΠΟΙΟ ΚΟΜΠΛΙΜΕΝΤΟ ΝΟΜΙΖΕΙΣ ΟΤΙ ΑΚΟΥΩ ΠΙΟ ΣΥΧΝΑ;",
    "ΣΟΥ ΦΑΙΝΟΜΑΙ ΠΡΩΙΝΟΣ ΤΥΠΟΣ Η ΝΥΧΤΟΠΟΥΛΙ; ΓΙΑΤΙ;",
    "ΠΟΙΟ ΦΑΣΤΦΟΥΝΤΑΔΙΚΟ ΝΟΜΙΖΕΙΣ ΟΤΙ ΕΙΝΑΙ ΠΙΟ ΠΙΘΑΝΟ ΝΑ ΕΠΙΛΕΞΩ; ΠΟΙΑ ΕΙΝΑΙ Η ΠΑΡΑΓΓΕΛΙΑ ΜΟΥ;",
    "ΤΙ ΣΟΥ ΛΕΕΙ Η ΓΛΩΣΣΑ ΤΟΥ ΣΩΜΑΤΟΣ ΜΟΥ ΑΥΤΗ ΤΗ ΣΤΙΓΜΗ;",
    "ΤΙ ΣΟΥ ΛΕΕΙ ΤΟ INSTAGRAM ΜΟΥ ΓΙΑ ΜΕΝΑ;",
    "ΠΙΣΤΕΥΕΙΣ ΟΤΙ ΤΑ ΦΥΤΑ ΕΥΔΟΚΙΜΟΥΝ Η ΠΕΘΑΙΝΟΥΝ ΟΤΑΝ ΤΑ ΦΡΟΝΤΙΖΩ; ΕΞΗΓΗΣΕ ΜΟΥ",
    "ΣΕ ΜΙΑ ΚΛΙΜΑΚΑ ΑΠΟ ΤΟ 1-10, ΠΟΣΟ ΑΚΑΤΑΣΤΑΤΟ ΝΟΜΙΖΕΙΣ ΟΤΙ ΕΙΝΑΙ ΤΟ ΑΥΤΟΚΙΝΗΤΟ ΜΟΥ; ΤΟ 1 ΣΗΜΑΙΝΕΙ ΚΑΘΟΛΟΥ, ΤΟ 10 ΑΠΟΛΥΤΗ ΚΑΤΑΣΤΡΟΦΗ",
    "ΠΙΣΤΕΥΕΙΣ ΟΤΙ ΗΜΟΥΝ ΔΗΜΟΦΙΛΗΣ ΣΤΟ ΣΧΟΛΕΙΟ; ΕΞΗΓΗΣΕ.",
    "ΠΙΣΤΕΥΕΙΣ ΟΤΙ ΕΧΩ ΑΠΟΛΥΘΕΙ ΠΟΤΕ ΑΠΟ ΜΙΑ ΔΟΥΛΕΙΑ; ΑΝ ΝΑΙ, ΓΙΑ ΠΟΙΟ ΛΟΓΟ;",
    "ΠΙΣΤΕΥΕΙΣ ΟΤΙ ΕΚΦΟΒΙΖΩ ΤΟΥΣ ΑΛΛΟΥΣ; ΓΙΑΤΙ Η ΓΙΑΤΙ ΟΧΙ;",
    "ΠΟΣΟ ΠΙΘΑΝΟ ΕΙΝΑΙ ΝΑ ΠΑΩ ΓΙΑ ΚΑΜΠΙΝΓΚ; ΠΟΣΟ ΑΠΑΙΤΗΤΙΚΟ ΕΙΝΑΙ ΤΟ ΓΟΥΣΤΟ ΜΟΥ;",
    "ΤΙ ΕΙΝΑΙ ΤΟ ΠΙΟ ΠΑΡΑΞΕΝΟ Η ΤΟ ΛΙΓΟΤΕΡΟ ΟΙΚΕΙΟ ΓΙΑ ΕΣΕΝΑ ΠΑΝΩ ΜΟΥ;",
    "ΑΝ ΤΟ MYSPACE ΥΠΗΡΧΕ ΑΚΟΜΑ, ΠΟΙΟ ΘΑ ΗΤΑΝ ΤΟ ΤΡΑΓΟΥΔΙ ΤΟΥ ΠΡΟΦΙΛ ΜΟΥ;",
    "ΤΙ ΣΕ ΙΝΤΡΙΓΚΑΡΕΙ ΠΑΝΩ ΜΟΥ;",
    "ΤΙ ΣΟΥ ΛΕΕΙ ΤΟ ΣΤΥΛ ΜΟΥ ΓΙΑ ΜΕΝΑ;",
    "ΠΙΣΤΕΥΕΙΣ ΟΤΙ ΜΟΥ ΕΧΟΥΝ ΡΑΓΙΣΕΙ ΠΟΤΕ ΤΗΝ ΚΑΡΔΙΑ;",
    "ΝΟΜΙΖΕΙΣ ΟΤΙ ΕΧΩ ΕΡΩΤΕΥΤΕΙ;",
    "ΠΟΙΑ ΕΙΝΑΙ Η ΧΕΙΡΟΤΕΡΗ ΕΙΚΑΣΙΑ ΠΟΥ ΕΧΕΙ ΚΑΝΕΙ ΚΑΠΟΙΟΣ ΓΙΑ ΣΕΝΑ;",
  ];

  let levelTwo = [
    "ΠΟΙΟ ΕΙΝΑΙ ΤΟ ΧΑΡΑΚΤΗΡΙΣΤΙΚΟ ΠΟΥ ΣΕ ΧΑΡΑΚΤΗΡΙΖΕΙ;",
    "ΠΟΙΟΣ ΕΙΝΑΙ Ο ΜΕΓΑΛΥΤΕΡΟΣ ΠΟΝΟΣ ΠΟΥ ΕΧΕΙΣ ΥΠΟΣΤΕΙ ΠΟΤΕ ΚΑΙ ΔΕΝ ΗΤΑΝ ΣΩΜΑΤΙΚΟΣ;",
    "ΠΩΣ ΕΙΣΑΙ ΣΤ' ΑΛΗΘΕΙΑ;",
    "ΠΟΙΟ ΕΙΝΑΙ ΤΟ ΤΕΛΕΥΤΑΙΟ ΠΡΑΓΜΑ ΓΙΑ ΤΟ ΟΠΟΙΟ ΣΟΥ ΕΙΠΕ ΨΕΜΑΤΑ Η ΜΑΜΑ ΣΟΥ;",
    "ΠΟΙΟ ΕΙΝΑΙ ΤΟ ΟΝΟΜΑ ΤΟΥ ΠΑΤΕΡΑ ΣΟΥ ΚΑΙ ΕΝΑ ΠΡΑΓΜΑ ΣΧΕΤΙΚΑ Μ' ΑΥΤΟΝ;",
    "ΤΙ ΕΧΩ ΑΝΕΧΤΕΙ ΑΠΟ ΑΝΘΡΩΠΟΥΣ ΣΤΟ ΠΑΡΕΛΘΟΝ ΤΟ ΟΠΟΙΟ ΔΕΝ ΜΠΟΡΩ ΝΑ ΑΝΕΧΤΩ ΠΛΕΟΝ;",
    "ΚΑΤΙ ΠΟΥ ΕΦΕΡΕ ΕΝΑ ΧΑΜΟΓΕΛΟ ΣΤΟ ΠΡΟΣΩΠΟ ΜΟΥ ΑΥΤΗ ΤΗΝ ΕΒΔΟΜΑΔΑ ΗΤΑΝ ___.",
    "ΤΙ ΑΙΣΘΑΝΕΣΑΙ ΠΟΛΥ ΤΟΝ ΤΕΛΕΥΤΑΙΟ ΚΑΙΡΟ;",
    "ΤΙ ΧΡΕΙΑΖΕΣΑΙ ΑΥΤΗ ΤΗ ΣΤΙΓΜΗ ΑΛΛΑ ΔΕΝ ΤΟ ΕΠΙΚΟΙΝΩΝΕΙΣ;",
    "ΤΙ ΕΙΝΑΙ ΑΥΤΟ ΠΟΥ ΔΟΥΛΕΥΕΙΣ ΑΥΤΗ ΤΗ ΣΤΙΓΜΗ ΚΑΙ ΟΙ ΑΛΛΟΙ ΔΕΝ ΤΟ ΒΛΕΠΟΥΝ;",
    "ΠΟΙΟ ΗΤΑΝ ΤΟ ΣΗΜΑΝΤΙΚΟΤΕΡΟ ΣΗΜΕΙΟ ΚΑΜΠΗΣ ΣΤΗ ΖΩΗ ΣΟΥ ΣΧΕΤΙΚΑ ΜΕ ΤΑ ΡΑΝΤΕΒΟΥ;",
    "ΤΙ ΣΟΥ ΛΕΕΙ Η ΚΑΡΔΙΑ ΣΟΥ;",
    "ΠΟΙΟ ΕΙΝΑΙ ΤΟ ΠΙΟ ΤΟΞΙΚΟ ΧΑΡΑΚΤΗΡΙΣΤΙΚΟ ΣΟΥ ΠΟΥ ΜΠΟΡΕΙΣ ΝΑ ΠΑΡΑΔΕΧΤΕΙΣ;",
    "ΠΟΙΟΣ ΣΤΗ ΖΩΗ ΣΟΥ ΑΞΙΖΕΙ ΤΟ ΜΕΓΑΛΥΤΕΡΟ ΕΥΧΑΡΙΣΤΩ; ΕΝΗΜΕΡΩΣΕ ΤΟΝ ΑΝ ΜΠΟΡΕΙΣ.",
    "ΤΙ ΠΑΡΑΣΚΕΦΤΕΣΑΙ ΑΥΤΗ ΤΗ ΣΤΙΓΜΗ;",
    "ΤΙ ΣΕ ΔΙΔΑΞΕ Η ΤΕΛΕΥΤΑΙΑ ΣΟΥ ΣΧΕΣΗ ΓΙΑ ΤΟΝ ΕΑΥΤΟ ΣΟΥ;",
    "ΠΟΙΑ ΠΕΠΟΙΘΗΣΗ ΓΙΑ ΤΟΝ ΕΑΥΤΟ ΣΟΥ ΔΕΝ ΣΟΥ ΧΡΗΣΙΜΕΥΕΙ ΠΛΕΟΝ;",
    "ΤΙ ΠΡΕΠΕΙ ΝΑ ΣΥΓΧΩΡΕΣΕΙΣ ΣΤΟΝ ΕΑΥΤΟ ΣΟΥ;",
    "ΠΟΙΟ ΕΙΝΑΙ ΤΟ ΠΙΟ ΔΥΣΚΟΛΟ ΜΑΘΗΜΑ ΠΟΥ ΠΗΡΕΣ ΣΤΟΝ ΕΡΩΤΑ;",
    "ΜΕ ΠΛΗΓΩΣΕΣ, ΑΛΛΑ ΣΕ ΕΥΧΑΡΙΣΤΩ ΓΙΑ ___.",
    "ΜΕ ΠΟΙΟΝ ΣΤΗ ΖΩΗ ΣΟΥ ΜΠΟΡΕΙΣ ΝΑ ΕΙΣΑΙ ΠΕΡΙΣΣΟΤΕΡΟ ΕΥΑΛΩΤΟΣ;",
    "ΠΟΙΟ ΑΠΟ ΤΑ ΧΑΡΑΚΤΗΡΙΣΤΙΚΑ ΤΗΣ ΠΡΟΣΩΠΙΚΟΤΗΤΑΣ ΤΩΝ ΓΟΝΙΩΝ ΣΟΥ ΘΕΛΕΙΣ ΝΑ ΚΡΑΤΗΣΕΙΣ/ΑΦΗΣΕΙΣ",
    "ΑΓΑΠΗΤΕ ΝΕΩΤΕΡΕ ΜΟΥ ΕΑΥΤΕ: ____.",
    "ΣΚΕΨΟΥ ΚΑΠΟΙΟΝ ΠΟΥ ΘΑΥΜΑΖΕΙΣ. ΓΙΑΤΙ ΣΟΥ ΗΡΘΕ ΣΤΟ ΜΥΑΛΟ ΑΥΤΟ ΤΟ ΠΡΟΣΩΠΟ;",
    "ΛΕΣ ΨΕΜΑΤΑ ΣΤΟΝ ΕΑΥΤΟ ΣΟΥ ΓΙΑ ΚΑΤΙ;",
    "ΠΟΙΟ ΕΙΝΑΙ ΤΟ ΑΓΑΠΗΜΕΝΟ ΜΕΡΟΣ ΤΟΥ ΕΑΥΤΟΥ ΣΟΥ ΠΟΥ ΔΕΝ ΕΙΝΑΙ ΣΩΜΑΤΙΚΟ;",
    "ΠΟΙΟ ΕΙΝΑΙ ΤΟ ΠΙΟ ΔΥΣΚΟΛΟ ΠΡΑΓΜΑ ΤΟΥ ΝΑ ΒΓΑΙΝΕΙΣ ΡΑΝΤΕΒΟΥ ΜΑΖΙ ΣΟΥ;",
    "ΑΙΣΘΑΝΟΜΑΙ ΟΤΙ ΜΕ ΑΓΑΠΟΥΝ ΟΤΑΝ ___.",
    "ΤΙ ΕΙΝΑΙ ΚΑΤΙ ΠΟΥ ΕΜΑΘΕΣ ΓΙΑ ΤΟΝ ΕΑΥΤΟ ΣΟΥ ΑΥΤΗ ΤΗΝ ΕΒΔΟΜΑΔΑ;",
    "Η ΑΥΤΟΑΓΑΠΗ ΕΙΝΑΙ ___.",
    "ΠΟΙΟ ΗΤΑΝ ΤΟ ΜΑΘΗΜΑ ΣΤΗΝ ΠΙΟ ΠΡΟΣΦΑΤΗ ΕΠΩΔΥΝΗ ΕΜΠΕΙΡΙΑ ΣΟΥ;",
    "ΞΕΡΩ ΟΤΙ ΕΙΜΑΙ ΕΡΩΤΕΥΜΕΝΟΣ ΟΤΑΝ ___.",
    "ΠΟΙΟΣ ΕΙΝΑΙ Ο ΑΓΑΠΗΜΕΝΟΣ ΣΤΙΧΟΣ ΤΡΑΓΟΥΔΙΟΥ ΠΟΥ ΣΟΥ ΕΡΧΕΤΑΙ ΑΠΑΥΘΕΙΑΣ ΣΤΟ ΜΥΑΛΟ;",
    "ΠΩΣ ΞΕΠΕΡΑΣΕΣ ΤΟΝ ΠΡΩΤΟ ΣΟΥ ΕΡΩΤΑ;",
    "ΠΟΙΟ ΕΙΝΑΙ ΤΟ ΚΑΛΥΤΕΡΟ ΜΑΘΗΜΑ ΠΟΥ ΣΟΥ ΕΔΩΣΕ ΠΟΤΕ ΕΝΑΣ ΠΡΩΗΝ;",
    "ΥΠΑΡΧΕΙ ΚΑΠΟΙΟΣ ΠΟΥ ΣΟΥ ΕΧΕΙ ΑΛΛΑΞΕΙ ΤΗ ΖΩΗ ΑΛΛΑ ΔΕΝ ΤΟ ΞΕΡΕΙ;",
    "ΤΙ ΧΡΕΙΑΖΕΣΑΙ ΑΥΤΗ ΤΗ ΣΤΙΓΜΗ ΠΕΡΙΣΣΟΤΕΡΟ ΑΠΟ ΟΤΙΔΗΠΟΤΕ ΑΛΛΟ;",
    "ΠΟΤΕ ΗΤΑΝ Η ΤΕΛΕΥΤΑΙΑ ΦΟΡΑ ΠΟΥ ΑΙΣΘΑΝΘΗΚΕΣ ΤΥΧΕΡΟΣ ΠΟΥ ΕΙΣΑΙ Ο ΕΑΥΤΟΣ ΣΟΥ;",
    "ΤΙ ΠΡΕΠΕΙ ΝΑ ΑΠΟΔΕΧΤΕΙΣ ΣΗΜΕΡΑ;",
    "ΠΟΤΕ ΗΤΑΝ Η ΤΕΛΕΥΤΑΙΑ ΦΟΡΑ ΠΟΥ ΑΙΣΘΑΝΘΗΚΕΣ ΠΕΡΙΣΣΟΤΕΡΟ Ο ΕΑΥΤΟΣ ΣΟΥ;",
    "ΠΩΣ ΛΕΓΕΤΑΙ Η ΜΗΤΕΡΑ ΣΟΥ ΚΑΙ ΠΟΙΟ ΕΙΝΑΙ ΤΟ ΠΙΟ ΠΟΛΥΤΙΜΟ ΜΑΘΗΜΑ ΠΟΥ ΣΟΥ ΕΧΕΙ ΔΙΔΑΞΕΙ ΜΕΧΡΙ ΤΩΡΑ;",
    "ΓΙΑ ΠΟΙΟ ΠΡΑΓΜΑ ΕΙΣΑΙ ΠΕΡΙΣΣΟΤΕΡΟ ΕΥΓΝΩΜΩΝ ΑΥΤΗ ΤΗ ΣΤΙΓΜΗ;",
    "ΤΙ ΠΡΟΣΠΑΘΕΙΣ ΑΚΟΜΑ ΝΑ ΑΠΟΔΕΙΞΕΙΣ ΣΤΟΝ ΕΑΥΤΟ ΣΟΥ;",
    "ΤΙ ΘΕΩΡΕΙΣ ΔΕΔΟΜΕΝΟ ΤΟΝ ΤΕΛΕΥΤΑΙΟ ΚΑΙΡΟ;",
    "ΥΠΑΡΧΕΙ ΚΑΠΟΙΟ ΣΥΝΑΙΣΘΗΜΑ ΠΟΥ ΣΟΥ ΛΕΙΠΕΙ;",
    "ΤΙ ΔΕΝ ΘΑ ΠΙΣΤΕΥΕ Ο ΝΕΟΤΕΡΟΣ ΕΑΥΤΟΣ ΣΟΥ ΓΙΑ ΤΗ ΖΩΗ ΣΟΥ ΣΗΜΕΡΑ;",
    "ΑΝ ΜΠΟΡΟΥΣΕΣ ΝΑ ΤΟ ΚΑΝΕΙΣ ΟΠΩΣ ΕΣΥ ΘΕΛΕΙΣ: ΜΕ ΠΟΙΟΝ ΘΑ ΗΣΟΥΝ; ΠΟΥ ΘΑ ΗΣΑΣΤΑΝ; ΚΑΙ ΤΙ ΘΑ ΚΑΝΑΤΕ;",
    "ΤΙ ΕΧΕΙΣ ΑΝΑΓΚΗ ΝΑ ΑΚΟΥΣΕΙΣ ΑΥΤΗ ΤΗ ΣΤΙΓΜΗ;",
    "ΠΟΙΟΝ ΤΙΤΛΟ ΘΑ ΕΔΙΝΕΣ ΣΕ ΑΥΤΟ ΤΟ ΚΕΦΑΛΑΙΟ ΤΗΣ ΖΩΗΣ ΣΟΥ;",
    "ΠΟΙΑ ΣΥΜΒΟΥΛΗ ΓΙΑ ΡΑΝΤΕΒΟΥ ΘΑ ΕΔΙΝΕΣ ΣΤΟΝ ΝΕΟΤΕΡΟ ΕΑΥΤΟ ΣΟΥ;",
    "ΠΟΙΟ ΜΑΘΗΜΑ ΘΑ ΕΠΡΕΠΕ ΝΑ ΕΙΧΕΣ ΠΑΡΕΙ ΜΕΧΡΙ ΤΩΡΑ;",
    "ΠΟΤΕ ΗΤΑΝ Η ΤΕΛΕΥΤΑΙΑ ΦΟΡΑ ΠΟΥ ΜΠΟΡΕΣΕΣ ΝΑ ΧΡΗΣΙΜΟΠΟΙΗΣΕΙΣ ΤΟΝ ΠΟΝΟ ΣΟΥ ΓΙΑ ΝΑ ΒΟΗΘΗΣΕΙΣ ΚΑΠΟΙΟΝ ΑΛΛΟ;",
    "ΤΙ ΔΕΝ ΘΑ ΗΘΕΛΕΣ ΠΟΤΕ ΝΑ ΑΛΛΑΞΕΙΣ ΣΤΟΝ ΕΑΥΤΟ ΣΟΥ;",
    "ΜΕ ΠΟΙΑ ΑΠΟΡΙΑ ΣΕ ΑΦΗΣΕ ΑΥΤΗ Η ΧΡΟΝΙΑ;",
    "ΤΙ ΕΙΝΑΙ ΠΙΟ ΔΥΣΚΟΛΟ ΝΑ ΠΑΡΑΔΕΧΤΕΙΣ ΓΙΑ ΤΟΝ ΕΑΥΤΟ ΣΟΥ;",
    "ΠΟΙΟ ΕΡΩΤΗΜΑ ΠΡΟΣΠΑΘΕΙΣ ΝΑ ΑΠΑΝΤΗΣΕΙΣ ΠΕΡΙΣΣΟΤΕΡΟ ΣΤΗ ΖΩΗ ΣΟΥ ΑΥΤΗ ΤΗ ΣΤΙΓΜΗ;",
    "ΟΛΟΚΛΗΡΩΣΕ ΤΙΣ ΠΡΟΤΑΣΕΙΣ: ΟΙ ΑΓΝΩΣΤΟΙ ΘΑ ΜΕ ΠΕΡΙΕΓΡΑΦΑΝ ΩΣ _____. ΜΟΝΟ ΕΓΩ ΞΕΡΩ ΟΤΙ ΕΙΜΑΙ ______",
    "ΟΤΑΝ ΣΕ ΡΩΤΟΥΝ ΠΩΣ ΕΙΣΑΙ, ΠΟΣΟ ΣΥΧΝΑ ΑΠΑΝΤΑΣ ΜΕ ΕΙΛΙΚΡΙΝΕΙΑ;",
    "ΕΧΕΙ ΑΛΛΑΞΕΙ ΠΟΤΕ ΕΝΑΣ ΞΕΝΟΣ ΤΗ ΖΩΗ ΣΟΥ;",
    "ΠΟΙΟ ΕΙΝΑΙ ΤΟ ΠΙΟ ΑΝΕΞΗΓΗΤΟ ΠΡΑΓΜΑ ΠΟΥ ΣΟΥ ΕΧΕΙ ΣΥΜΒΕΙ ΠΟΤΕ;",
    "ΠΕΡΙΕΓΡΑΨΕ ΤΗΝ ΤΕΛΕΙΑ ΜΕΡΑ ΣΟΥ!",
    "ΕΧΕΙΣ ΑΛΛΑΞΕΙ ΓΝΩΜΗ ΓΙΑ ΚΑΤΙ ΠΡΟΣΦΑΤΑ;",
    "ΠΟΙΟ ΗΤΑΝ ΤΟ ΚΑΛΥΤΕΡΟ ΚΟΜΠΛΙΜΕΝΤΟ ΠΟΥ ΣΟΥ ΕΧΕΙ ΚΑΝΕΙ ΠΟΤΕ ΕΝΑΣ ΞΕΝΟΣ;",
    "ΠΟΙΟ ΕΙΝΑΙ ΕΝΑ ΚΟΜΠΛΙΜΕΝΤΟ ΠΟΥ ΘΑ ΗΘΕΛΕΣ ΝΑ ΛΑΜΒΑΝΕΙΣ ΠΙΟ ΣΥΧΝΑ;",
    "ΤΙ ΕΙΝΑΙ ΑΥΤΟ ΠΟΥ ΕΠΙΘΥΜΕΙΣ ΠΕΡΙΣΣΟΤΕΡΟ;",
    "ΠΟΙΑ ΗΤΑΝ Η ΠΡΩΤΗ ΣΟΥ ΑΝΑΜΝΗΣΗ ΕΥΤΥΧΙΑΣ;",
    "ΤΙ ΦΟΒΑΣΑΙ ΠΕΡΙΣΣΟΤΕΡΟ, ΤΗΝ ΑΠΟΤΥΧΙΑ Η ΤΗΝ ΕΠΙΤΥΧΙΑ; ΚΑΙ ΓΙΑΤΙ;",
    "ΠΩΣ ΘΑ ΠΕΡΙΕΓΡΑΦΕΣ ΜΕ ΜΙΑ ΛΕΞΗ ΤΟ ΣΥΝΑΙΣΘΗΜΑ ΤΟΥ ΝΑ ΕΙΣΑΙ ΕΡΩΤΕΥΜΕΝΟΣ;",
    "ΠΟΤΕ ΗΤΑΝ Η ΤΕΛΕΥΤΑΙΑ ΦΟΡΑ ΠΟΥ ΕΞΕΠΛΗΞΕΣ ΤΟΝ ΕΑΥΤΟ ΣΟΥ;",
    "ΠΟΙΑ ΗΤΑΝ Η ΠΙΟ ΕΥΤΥΧΙΣΜΕΝΗ ΣΟΥ ΑΝΑΜΝΗΣΗ ΤΟΝ ΤΕΛΕΥΤΑΙΟ ΧΡΟΝΟ;",
    "ΠΙΣΤΕΥΕΙΣ ΟΤΙ Η ΕΙΚΟΝΑ ΠΟΥ ΕΧΕΙΣ ΓΙΑ ΤΟΝ ΕΑΥΤΟ ΣΟΥ ΤΑΙΡΙΑΖΕΙ ΜΕ ΤΗΝ ΕΙΚΟΝΑ ΠΟΥ ΒΛΕΠΟΥΝ ΟΙ ΑΛΛΟΙ ΣΕ ΣΕΝΑ;",
    "ΑΝ ΝΑΙ, ΠΟΤΕ ΗΤΑΝ Η ΣΤΙΓΜΗ ΠΟΥ ΣΥΝΕΙΔΗΤΟΠΟΙΗΣΕΣ ΟΤΙ ΔΕΝ ΕΙΣΑΙ ΑΝΙΚΗΤΟΣ;",
    "ΠΟΙΟ ΜΑΘΗΜΑ ΣΟΥ ΠΗΡΕ ΠΕΡΙΣΣΟΤΕΡΟ ΧΡΟΝΟ ΓΙΑ ΝΑ ΤΟ ΞΕΜΑΘΕΙΣ;",
    "ΠΟΙΟ ΜΕΡΟΣ ΤΗΣ ΖΩΗΣ ΣΟΥ ΛΕΙΤΟΥΡΓΕΙ; ΠΟΙΟ ΜΕΡΟΣ ΤΗΣ ΖΩΗΣ ΣΟΥ ΠΟΝΑΕΙ;",
    "ΠΟΙΟ ΕΙΝΑΙ ΤΟ ΟΝΟΜΑ ΤΟΥ ΠΡΩΤΟΥ ΕΡΩΤΑ ΣΟΥ ΚΑΙ Ο ΛΟΓΟΣ ΠΟΥ ΤΟΝ/ΤΗΝ ΕΡΩΤΕΥΤΗΚΕΣ;",
    "ΠΟΙΟ ΕΙΝΑΙ ΤΟ ΟΝΟΜΑ ΤΗΣ ΜΗΤΕΡΑΣ ΣΟΥ ΚΑΙ ΤΟ ΠΙΟ ΟΜΟΡΦΟ ΠΡΑΓΜΑ ΣΕ ΑΥΤΗΝ;",
    "ΑΝ ΜΠΟΡΟΥΣΕΣ ΝΑ ΓΝΩΡΙΣΕΙΣ ΚΑΠΟΙΟΝ ΣΤΗ ΖΩΗ ΣΟΥ ΣΕ ΒΑΘΥΤΕΡΟ ΕΠΙΠΕΔΟ, ΠΟΙΟΣ ΘΑ ΗΤΑΝ ΑΥΤΟΣ ΚΑΙ ΓΙΑΤΙ;",
    "ΣΟΥ ΛΕΙΠΕΙ ΚΑΠΟΙΟΣ ΑΥΤΗ ΤΗ ΣΤΙΓΜΗ; ΝΟΜΙΖΕΙΣ ΟΤΙ ΤΟΥ ΛΕΙΠΕΙΣ ΚΙ ΕΣΥ;",
    "ΠΟΙΟ ΕΙΝΑΙ ΕΝΑ ΟΝΕΙΡΟ ΠΟΥ ΕΧΕΙΣ ΑΦΗΣΕΙ ΠΙΣΩ ΣΟΥ;",
    "ΠΟΙΟ ΕΙΝΑΙ ΤΟ ΤΕΛΕΥΤΑΙΟ ΠΡΑΓΜΑ ΓΙΑ ΤΟ ΟΠΟΙΟ ΕΙΠΕΣ ΨΕΜΑΤΑ ΣΤΗ ΜΗΤΕΡΑ ΣΟΥ;",
    "ΕΧΕΙΣ ΠΕΙ ΠΟΤΕ ΣΕ ΚΑΠΟΙΟΝ ΟΤΙ ΣΕ ΑΓΑΠΩ ΑΛΛΑ ΔΕΝ ΤΟ ΕΝΝΟΟΥΣΕΣ; ΑΝ ΝΑΙ, ΓΙΑΤΙ;",
    "ΠΩΣ ΜΠΟΡΕΙΣ ΝΑ ΓΙΝΕΙΣ ΚΑΛΥΤΕΡΟΣ ΑΝΘΡΩΠΟΣ;",
  ];

  let levelThree = [
    "ΣΕ ΤΙ ΜΠΟΡΩ ΝΑ ΣΕ ΒΟΗΘΗΣΩ;",
    "ΓΙΑΤΙ ΝΟΜΙΖΕΙΣ ΟΤΙ ΓΝΩΡΙΣΤΗΚΑΜΕ;",
    "ΤΙ ΣΕ ΕΞΕΠΛΗΞΕ ΣΕ ΜΕΝΑ;",
    "ΜΕ ΜΙΑ ΛΕΞΗ, ΠΩΣ ΘΑ ΠΕΡΙΕΓΡΑΦΕΣ ΤΗ ΣΥΖΗΤΗΣΗ ΜΑΣ;",
    "ΠΟΙΑ ΝΟΜΙΖΕΙΣ ΟΤΙ ΕΙΝΑΙ Η ΔΥΝΑΜΗ ΜΟΥ;",
    "ΤΙ ΜΠΟΡΩ ΝΑ ΣΟΥ ΔΙΔΑΞΩ;",
    "ΜΕ ΒΑΣΗ ΑΥΤΑ ΠΟΥ ΕΜΑΘΕΣ ΓΙΑ ΜΕΝΑ, ΕΧΕΙΣ ΝΑ ΠΡΟΤΕΙΝΕΙΣ ΚΑΤΙ ΓΙΑ ΤΟ NETFLIX;",
    "ΠΟΙΟΝ ΣΟΥ ΘΥΜΙΖΩ;",
    "ΤΙ ΜΠΟΡΕΙΣ ΝΑ ΚΑΝΕΙΣ ΣΗΜΕΡΑ ΓΙΑ ΝΑ ΕΙΣΑΙ ΠΙΟ ΕΥΓΕΝΙΚΟΣ ΑΠΕΝΑΝΤΙ ΣΤΟΝ ΕΑΥΤΟ ΣΟΥ;",
    "ΠΟΙΟ ΕΙΝΑΙ ΕΝΑ ΜΙΚΡΟ ΠΡΑΓΜΑ ΠΟΥ ΜΠΟΡΕΙΣ ΝΑ ΚΑΝΕΙΣ ΓΙΑ ΝΑ ΓΙΝΕΙΣ ΚΑΛΥΤΕΡΟΣ ΑΝΘΡΩΠΟΣ ΤΟ 2023;",
    "ΤΙ ΜΠΟΡΟΥΜΕ ΝΑ ΔΗΜΙΟΥΡΓΗΣΟΥΜΕ ΜΑΖΙ;",
    "ΠΩΣ ΘΑ ΜΕ ΠΕΡΙΕΓΡΑΦΕΣ ΣΕ ΕΝΑΝ ΞΕΝΟ;",
    "ΤΙ ΣΕ ΕΞΕΠΛΗΞΕ ΠΕΡΙΣΣΟΤΕΡΟ ΣΕ ΜΕΝΑ;",
    "ΠΟΙΟ ΘΑ ΗΤΑΝ ΤΟ ΤΕΛΕΙΟ ΔΩΡΟ ΓΙΑ ΜΕΝΑ;",
    "ΤΙ ΘΑΥΜΑΖΕΙΣ ΠΕΡΙΣΣΟΤΕΡΟ ΣΕ ΜΕΝΑ;",
    "ΜΕ ΒΑΣΗ ΑΥΤΑ ΠΟΥ ΕΜΑΘΕΣ ΓΙΑ ΜΕΝΑ, ΠΟΙΟ ΒΙΒΛΙΟ ΘΑ ΜΟΥ ΣΥΝΙΣΤΟΥΣΕΣ ΝΑ ΔΙΑΒΑΣΩ;",
    "ΤΙ ΓΙΑ ΜΕΝΑ ΕΙΝΑΙ ΠΙΟ ΔΥΣΚΟΛΟ ΝΑ ΚΑΤΑΛΑΒΕΙΣ;",
    "ΓΙΑ ΠΟΙΟ ΘΕΜΑ ΕΙΜΑΙ ΚΑΤΑΛΛΗΛΟΣ ΝΑ ΣΟΥ ΔΩΣΩ ΣΥΜΒΟΥΛΕΣ;",
    "ΠΟΙΟ ΕΙΝΑΙ ΕΝΑ ΠΡΑΓΜΑ ΠΟΥ ΠΙΣΤΕΥΕΙΣ ΟΤΙ ΜΠΟΡΩ ΝΑ ΚΑΝΩ ΚΑΙ ΘΑ ΒΕΛΤΙΩΝΕ ΔΡΑΜΑΤΙΚΑ ΤΗ ΖΩΗ ΜΟΥ;",
    "ΑΝ ΗΜΑΣΤΑΝ ΣΕ ΣΥΓΚΡΟΤΗΜΑ, ΠΟΙΟ ΘΑ ΗΤΑΝ ΤΟ ΟΝΟΜΑ ΜΑΣ;",
    "ΜΕ ΒΑΣΗ ΑΥΤΑ ΠΟΥ ΕΜΑΘΕΣ ΓΙΑ ΜΕΝΑ, ΤΑ ΜΕΣΑ ΚΟΙΝΩΝΙΚΗΣ ΔΙΚΤΥΩΣΗΣ ΠΟΥ ΔΙΑΘΕΤΩ ΑΝΤΙΚΑΤΟΠΤΡΙΖΟΥΝ ΜΕ ΑΚΡΙΒΕΙΑ ΤΟ ΠΟΙΟΣ ΕΙΜΑΙ; ΓΙΑΤΙ Η ΓΙΑΤΙ ΟΧΙ;",
    "ΤΙ ΕΧΩ ΑΝΑΓΚΗ ΝΑ ΑΚΟΥΣΩ ΑΥΤΗ ΤΗ ΣΤΙΓΜΗ;",
    "ΜΕ ΒΑΣΗ ΑΥΤΑ ΠΟΥ ΞΕΡΕΙΣ ΓΙΑ ΜΕΝΑ, ΕΧΕΙΣ ΚΑΠΟΙΑ ΠΡΟΤΑΣΗ ΓΙΑ ΤΟ NETFLIX;",
    "ΠΟΙΑ ΠΙΣΤΕΥΕΙΣ ΟΤΙ ΕΙΝΑΙ Η ΥΠΕΡΔΥΝΑΜΗ ΜΟΥ;",
    "ΠΟΙΟ ΕΙΝΑΙ ΤΟ ΜΑΘΗΜΑ ΠΟΥ ΘΑ ΠΑΡΕΙΣ ΑΠΟ ΤΗ ΣΥΖΗΤΗΣΗ ΜΑΣ;",
    "ΠΟΤΕ ΣΕ ΑΥΤΟ ΤΟ ΠΑΙΧΝΙΔΙ ΑΙΣΘΑΝΘΗΚΕΣ ΠΙΟ ΣΥΝΔΕΔΕΜΕΝΟΣ ΜΑΖΙ ΜΟΥ;",
    "ΠΩΣ ΚΕΡΔΙΖΕΙ ΚΑΝΕΙΣ ΤΗΝ ΕΥΑΛΩΤΟΤΗΤΑ ΣΟΥ; ΤΗΝ ΚΕΡΔΙΣΑ; ΠΩΣ ΜΠΟΡΩ ΝΑ ΚΕΡΔΙΣΩ ΠΕΡΙΣΣΟΤΕΡΑ;",
    "ΠΟΙΑ ΠΙΣΤΕΥΕΙΣ ΟΤΙ ΕΙΝΑΙ Η ΠΙΟ ΣΗΜΑΝΤΙΚΗ ΜΑΣ ΟΜΟΙΟΤΗΤΑ;",
    "ΠΟΙΑ ΑΠΑΝΤΗΣΗ ΜΟΥ ΣΕ ΕΚΑΝΕ ΝΑ ΖΩΝΤΑΝΕΨΕΙΣ ΞΑΦΝΙΚΑ ΑΠΟ ΧΑΡΑ;",
    "ΟΤΑΝ ΤΕΛΕΙΩΣΕΙ ΑΥΤΟ ΤΟ ΠΑΙΧΝΙΔΙ, ΤΙ ΘΑ ΘΥΜΑΣΑΙ ΓΙΑ ΜΕΝΑ;",
    "ΠΟΙΑ ΕΡΩΤΗΣΗ ΦΟΒΗΘΗΚΕΣ ΠΕΡΙΣΣΟΤΕΡΟ ΝΑ ΑΠΑΝΤΗΣΕΙΣ;",
    "ΠΟΙΑ ΚΟΜΜΑΤΙΑ ΤΟΥ ΕΑΥΤΟΥ ΣΟΥ ΒΛΕΠΕΙΣ ΣΕ ΜΕΝΑ;",
    "ΠΩΣ ΑΛΛΗΛΟΣΥΜΠΛΗΡΩΝΟΝΤΑΙ ΟΙ ΠΡΟΣΩΠΙΚΟΤΗΤΕΣ ΜΑΣ;",
    "ΠΟΙΑ ΝΟΜΙΖΕΙΣ ΟΤΙ ΕΙΝΑΙ Η ΑΔΥΝΑΜΙΑ ΜΟΥ;",
    "ΤΙ ΘΑ ΣΕ ΕΚΑΝΕ ΝΑ ΝΙΩΣΕΙΣ ΠΙΟ ΚΟΝΤΑ ΣΕ ΜΕΝΑ;",
    "ΤΙ ΝΟΜΙΖΕΙΣ ΟΤΙ ΦΟΒΑΜΑΙ ΠΕΡΙΣΣΟΤΕΡΟ;",
    "ΤΙ ΣΟΥ ΕΜΑΘΕ ΑΥΤΗ Η ΣΥΖΗΤΗΣΗ ΓΙΑ ΤΟΝ ΕΑΥΤΟ ΣΟΥ;",
    "ΤΙ ΝΟΜΙΖΕΙΣ ΟΤΙ ΠΡΕΠΕΙ ΝΑ ΞΕΡΩ ΓΙΑ ΤΟΝ ΕΑΥΤΟ ΜΟΥ ΠΟΥ ΙΣΩΣ ΑΓΝΟΩ;",
    "ΠΟΙΟ ΝΟΜΙΖΕΙΣ ΟΤΙ ΕΙΝΑΙ ΤΟ ΚΑΘΟΡΙΣΤΙΚΟ ΧΑΡΑΚΤΗΡΙΣΤΙΚΟ ΜΟΥ;",
    "ΠΙΣΤΕΥΕΙΣ ΟΤΙ Ο ΚΑΘΕΝΑΣ ΕΧΕΙ ΕΝΑ ΚΑΛΕΣΜΑ; ΑΝ ΝΑΙ, ΠΙΣΤΕΥΕΙΣ ΟΤΙ ΕΧΩ ΒΡΕΙ ΤΟ ΔΙΚΟ ΜΟΥ;",
    "ΤΙ ΠΡΟΤΕΙΝΕΙΣ ΝΑ ΑΦΗΣΩ ΠΙΣΩ ΜΟΥ, ΝΑ ΞΕΧΑΣΩ, ΑΝ ΥΠΑΡΧΕΙ ΚΑΤΙ;",
    "ΜΕ ΜΙΑ ΛΕΞΗ, ΠΕΡΙΓΡΑΨΕ ΠΩΣ ΑΙΣΘΑΝΕΣΑΙ ΑΥΤΗ ΤΗ ΣΤΙΓΜΗ",
  ];

  let levels = {
    levelOne: shuffle(levelOne),
    levelTwo: shuffle(levelTwo),
    levelThree: shuffle(levelThree),
  };

  const [gameState] = React.useState(levels);
  const [currLevel, setLevel] = React.useState(Object.keys(levels)[0]);
  const [currCard, setCurrCard] = React.useState(levels[currLevel][0]);
  const [cardHistory, setCardHistory] = React.useState([]);

  const buttons = Object.keys(levels).map((level) => (
    <Button
      sx={{ width: { xs: "231px", sm: "180px", md: "231px" } }}
      variant={level === currLevel ? "outlined" : "contained"}
      color="primary"
      fontWeight="800"
      onClick={() => handleChangeLevel(level)}
      key={level}
    >
      {transform(level)}
    </Button>
  ));

  function handleChangeLevel(newLevel) {
    setLevel(newLevel);
    if (gameState[newLevel].length === 1) {
      const finalMessage = "ΤΕΛΟΣ ΕΠΙΠΕΔΟΥ!";
      setCurrCard(finalMessage);
    } else {
      setCurrCard(gameState[newLevel][0]);
    }
  }

  function handleNextCard() {
    const finalMessage = "ΤΕΛΟΣ ΕΠΙΠΕΔΟΥ!";
    if (gameState[currLevel].length === 1) {
      if (currCard === finalMessage) {
        return;
      } else {
        const tempHistory = [currCard, ...cardHistory];
        setCardHistory(tempHistory);
        setCurrCard(finalMessage);
      }
    } else {
      const tempHistory = [currCard, ...cardHistory];
      setCardHistory(tempHistory);
      gameState[currLevel].shift();
      setCurrCard(gameState[currLevel][0]);
    }
  }

  return (
    <Container maxWidth={false}>
      <Typography
        variant="h3"
        color="#c10016"
        textAlign="center"
        marginTop="3vh"
        marginBottom="3vh"
        fontWeight="800"
        textTransform="uppercase"
      >
        We're Not Really Strangers
      </Typography>
      <Stack
        textAlign="center"
        alignItems="center"
        fontWeight="800"
        direction={{ xs: "column", lg: "row" }}
        spacing={{ xs: 2, sm: 4, md: 4, lg: 0 }}
      >
        <Stack
          justifyContent="space-evenly"
          alignItems="center"
          padding="5px"
          spacing={{ xs: 1, sm: 2, md: 4 }}
          direction={{ xs: "column", sm: "row", lg: "column" }}
          width={{ lg: "30vw" }}
        >
          {buttons}
        </Stack>
        <Box
          alignItems="center"
        >
          <Card styleName="big-card" question={currCard} />
          <Button
            sx={{ width: "231px" }}
            variant="contained"
            color="primary"
            fontWeight="800"
            onClick={() => handleNextCard()}>
            ΕΠΟΜΕΝΗ ΚΑΡΤΑ
          </Button>
        </Box>
        <Stack
          padding="5px"
          width={{ xs: "70vw", lg: "30vw" }}
          justifyContent="center"
          alignItems="center"
        >
          <Typography
            variant="h6"
            color="#c10016"
            fontWeight="800"
          >
            ΠΡΟΗΓΟΥΜΕΝΕΣ ΚΑΡΤΕΣ
          </Typography>
          <Container
          sx={{
            height: "75vh",
            padding: "0px !important",
            margin: "10px",
            borderRadius: "15px",
            border: "solid 2px #c10016"
          }}
          >
            <Container
              sx={{
                width: "98%",
                height: "95%",
                overflowY: "scroll",
                overflowX: "hidden",
                display: "flex",
                flexDirection: "column",
                alignItems: "center",
              }}
            >
              {cardHistory.map((qn) => (
                <Card styleName="small-card" question={qn} key={qn} />
              ))}
            </Container>
          </Container>
        </Stack>
      </Stack>
    </Container>
  );
}

function shuffle(array) {
  var currentIndex = array.length,
    temporaryValue,
    randomIndex;

  // While there remain elements to shuffle...
  while (0 !== currentIndex) {
    // Pick a remaining element...
    randomIndex = Math.floor(Math.random() * currentIndex);
    currentIndex -= 1;

    // And swap it with the current element.
    temporaryValue = array[currentIndex];
    array[currentIndex] = array[randomIndex];
    array[randomIndex] = temporaryValue;
  }

  return array;
}

function transform(level) {
  switch(level) {
    case "levelOne":
      return "ΕΠΙΠΕΔΟ 1"
    case "levelTwo":
      return "ΕΠΙΠΕΔΟ 2"
    case "levelThree":
      return "ΕΠΙΠΕΔΟ 3"
    default:
      return "ERROR"
  }
}

export default App;
